/*  Class = "NSButton"; gToolTip = "Delete selected favorite (⌫)"; ObjectID = "17";  */
"Delete selected favorite (⌫)" = "Ausgewählten Favoriten löschen (⌫)";

/*  Class = "NSButton"; gToolTip = "Add favorite (⌥⌘A)"; ObjectID = "18";  */
"Add favorite (⌥⌘A)" = "Favoriten hinzufügen (⌥⌘A)";

/*  Class = "NSTableColumn"; headerCell.title = "Favorites"; ObjectID = "26";  */
"Favorites" = "Favoriten";

/*  Class = "NSTextFieldCell"; title = "Name:"; ObjectID = "122";  */
"Name:" = "Name:";

/*  Class = "NSTextFieldCell"; placeholderString = "[no selection]"; ObjectID = "124";  */
"[no selection]" = "[keine Auswahl]";

/*  Class = "NSButtonCell"; title = "Save"; ObjectID = "132";  */
"Save" = "Sichern";

/*  Class = "NSMenuItem"; title = "Remove"; ObjectID = "206";  */
"Remove" = "Löschen";

/*  Class = "NSMenuItem"; title = "Duplicate"; ObjectID = "212";  */
/*  Class = "NSMenuItem"; title = "Duplicate"; ObjectID = "359";  */
"Duplicate" = "Duplizieren";

/*  Class = "NSMenuItem"; gToolTip = "Save query of selected favorite to file"; ObjectID = "365";  */
"Save query of selected favorite to file" = "Abfrage aus ausgewähltem Favorit in Datei speichern";

/*  Class = "NSMenuItem"; title = "Save Query to File..."; ObjectID = "365";  */
"Save Query to File..." = "Abfrage in Datei speichern…";

/*  Class = "NSMenuItem"; gToolTip = "Remove all favorites"; ObjectID = "367";  */
"Remove all favorites" = "Alle Favoriten löschen";

/*  Class = "NSMenuItem"; title = "Remove All..."; ObjectID = "367";  */
"Remove All..." = "Alles löschen…";

/*  Class = "NSMenuItem"; title = "Save to File..."; ObjectID = "248";  */
"Save to File..." = "In Datei sichern…";

/*  Class = "NSMenuItem"; gToolTip = "Export selected favorites as SPF file"; ObjectID = "361";  */
"Export selected favorites as SPF file" = "Ausgewählte Favoriten als SPF-Datei exportieren";

/*  Class = "NSMenuItem"; title = "Export Selected Favorites…"; ObjectID = "361";  */
"Export Selected Favorites…" = "Ausgewählte Favoriten exportieren…";

/*  Class = "NSMenuItem"; gToolTip = "Import query favorites from SPF file and append them to the favorite list"; ObjectID = "363";  */
"Import query favorites from SPF file and append them to the favorite list" = "Favoriten aus SPF-Datei importieren und zu den aktuellen Favoriten hinzufügen";

/*  Class = "NSMenuItem"; title = "Import Favorites…"; ObjectID = "363";  */
"Import Favorites…" = "Favoriten importieren…";

/*  Class = "NSMenuItem"; gToolTip = "Import query favorites from SPF file and replace the current favorites"; ObjectID = "362";  */
"Import query favorites from SPF file and replace the current favorites" = "Favoriten aus SPF-Datei importieren und aktuelle Favoriten ersetzen";

/*  Class = "NSMenuItem"; title = "Import Favorites by Replacing…"; ObjectID = "362";  */
"Import Favorites by Replacing…" = "Favoriten importieren und ersetzen…";

/*  Class = "NSButtonCell"; title = "Cancel"; ObjectID = "272";  */
"Cancel" = "Abbrechen";

/*  Class = "NSTextFieldCell"; title = "Tab Trigger:"; ObjectID = "307";  */
"Tab Trigger:" = "Tab-Trigger:";

/*  Class = "NSMenuItem"; title = "Insert Placeholder"; ObjectID = "317";  */
"Insert Placeholder" = "Platzhalter einfügen";

/*  Class = "NSMenuItem"; gToolTip = "${1:default_value} – tab key snippet with a definable default value which will be selected\n\n[“1” can be a number from 0 to 18 and defines the order of tab key down events] "; ObjectID = "318";  */
"${1:default_value} – tab key snippet with a definable default value which will be selected\n\n[“1” can be a number from 0 to 18 and defines the order of tab key down events] " = "${1:default_value} – \"default value\" wird in den Abfrage-Editor eingefügt und ausgewählt.\n\n\"1\" kann eine Zahl zwischen 0 und 18 sein, welche die Reihenfolge bestimmt, in der die Snippets durch drücken der Tab-Taste ausgewählt werden.";

/*  Class = "NSMenuItem"; title = "Tab Snippet"; ObjectID = "318";  */
"Tab Snippet" = "Tab-Snippet";

/*  Class = "NSMenuItem"; gToolTip = "$(shell_command) – shell_command will be executed and inserts its result\n\n[press ⌘. to cancel the execution of “shell_command”]\n [only available inside of tab snippets] "; ObjectID = "319";  */
"$(shell_command) – shell_command will be executed and inserts its result\n\n[press ⌘. to cancel the execution of “shell_command”]\n [only available inside of tab snippets] " = "$(shell_command) – \"shell_command\" wird lokal ausgeführt und das Ergebnis wird in den Abfrage-Editor eingefügt.\nKkann nur innerhalb von Tab-Snippets benutzt werden!\n\n
Durch drücken von ⌘ (cmd-Taste) wird die Ausführung des Befehls abgebrochen.";

/*  Class = "NSMenuItem"; title = "Tab Snippet and Shell Command"; ObjectID = "319";  */
"Tab Snippet and Shell Command" = "Shell-Befehl";

/*  Class = "NSMenuItem"; gToolTip = "$SP_SELECTED_TABLE – will be replaced by the selected table name\n\n[only available inside of tab snippets]"; ObjectID = "321";  */
"$SP_SELECTED_TABLE – will be replaced by the selected table name\n\n[only available inside of tab snippets]" = "$SP_SELECTED_TABLE – Wird durch den Namen der ausgewählten Tabelle ersetzt.\nKann nur innerhalb von Tab-Snippets benutzt werden!";

/*  Class = "NSMenuItem"; title = "Name Of Selected Table"; ObjectID = "321";  */
"Name Of Selected Table" = "Name der ausgewählten Tabelle";

/*  Class = "NSMenuItem"; gToolTip = "$SP_SELECTED_TABLES – will be replaced by a comma separated list of all selected table names\n\n[only available inside of tab snippets]"; ObjectID = "322";  */
"$SP_SELECTED_TABLES – will be replaced by a comma separated list of all selected table names\n\n[only available inside of tab snippets]" = "$SP_SELECTED_TABLES – Wird mit einer (durch Kommas getrennten) Liste der ausgewählten Tabellen ersetzt.\nKann nur innerhalb von Tab-Snippets benutzt werden!";

/*  Class = "NSMenuItem"; title = "Name Of Selected Tables"; ObjectID = "322";  */
"Name Of Selected Tables" = "Namen der ausgewählten Tabellen";

/*  Class = "NSMenuItem"; gToolTip = "$SP_SELECTED_DATABASE – will be replaced by the selected database name\n\n[only available inside of tab snippets]"; ObjectID = "323";  */
"$SP_SELECTED_DATABASE – will be replaced by the selected database name\n\n[only available inside of tab snippets]" = "$SP_SELECTED_DATABASE – Wird mit dem Namen der ausgewählten Datenbank ersetzt.\nKann nur innerhalb von Tab-Snippets benutzt werden!";

/*  Class = "NSMenuItem"; title = "Name Of Selected Database"; ObjectID = "323";  */
"Name Of Selected Database" = "Name der ausgewählten Datenbank";

/*  Class = "NSMenuItem"; gToolTip = "¦a¦b¦ – such a snippet will be shown as completion list with the items “a” and “b”\n\n[only available inside of tab snippets]"; ObjectID = "326";  */
"¦a¦b¦ – such a snippet will be shown as completion list with the items “a” and “b”\n\n[only available inside of tab snippets]" = "¦a¦b¦ – Gibt dem Benutzer eine Liste mit den Einträgen \"a\" und \"b\" zur Auswahl, von denen einer eingefügt wird.\n(Der unterbrochene senkrechte Strich kann auf einer dt. Tastatur nicht geschrieben werden)\nKann nur innerhalb von Tab-Snippets verwendet werden!";

/*  Class = "NSMenuItem"; title = "List Template"; ObjectID = "326";  */
"List Template" = "Vorlage für Liste";

/*  Class = "NSMenuItem"; gToolTip = "¦¦a¦b¦¦ – such a snippet will be shown as completion list with the items “a” and “b” in fuzzy search mode\n\n[only available inside of tab snippets]"; ObjectID = "327";  */
"¦¦a¦b¦¦ – such a snippet will be shown as completion list with the items “a” and “b” in fuzzy search mode\n\n[only available inside of tab snippets]" = "¦¦a¦b¦¦ – Wird als Auswahlliste mit den Einträgen \"a\" und \"b\" angezeigt. Bei der Auswahl ist die UBA-Suche möglich.\nKann nur innerhalb von Tab-Snippets benutzt werden!";

/*  Class = "NSMenuItem"; title = "List Template (Fuzzy Search)"; ObjectID = "327";  */
"List Template (Fuzzy Search)" = "Vorlage für Liste (UBA-Suche)";

/*  Class = "NSMenuItem"; gToolTip = "¦ – list separator\n\n[only available inside of tab snippets]"; ObjectID = "328";  */
"¦ – list separator\n\n[only available inside of tab snippets]" = "¦ – Trennzeichen für Listeneinträge\nKann nur innerhalb von Tab-Snippets benutzt werden!";

/*  Class = "NSMenuItem"; title = "List Separator"; ObjectID = "328";  */
"List Separator" = "Trennzeichen";

/*  Class = "NSMenuItem"; gToolTip = "¦$SP_ASLIST_ALL_DATABASES¦ – such a snippet will be shown as completion list with all database names from the current connection\n\n[only available inside of tab snippets]"; ObjectID = "329";  */
"¦$SP_ASLIST_ALL_DATABASES¦ – such a snippet will be shown as completion list with all database names from the current connection\n\n[only available inside of tab snippets]" = "¦$SP_ASLIST_ALL_DATABASES¦ – Wird als Auswahlliste mit den Namen aller Datenbanken der aktuellen Verbindung angezeigt\nKann nur innerhalb von Tab-Snippets benutzt werden!";

/*  Class = "NSMenuItem"; title = "Database Names As List"; ObjectID = "329";  */
"Database Names As List" = "Datenbanken als Liste";

/*  Class = "NSMenuItem"; gToolTip = "¦¦$SP_ASLIST_ALL_DATABASES¦¦ – such a snippet will be shown as completion list with all database names from the current connection in fuzzy search mode\n\n[only available inside of tab snippets]"; ObjectID = "330";  */
"¦¦$SP_ASLIST_ALL_DATABASES¦¦ – such a snippet will be shown as completion list with all database names from the current connection in fuzzy search mode\n\n[only available inside of tab snippets]" = "¦¦$SP_ASLIST_ALL_DATABASES¦¦ – Wird als Auswahlliste mit den Namen aller Datenbanken der aktuellen Verbindung angezeigt. Bei der Auswahl ist die UBA-Suche möglich.\nKann nur innerhalb von Tab-Snippets benutzt werden!";

/*  Class = "NSMenuItem"; title = "Database Names As List (Fuzzy Search)"; ObjectID = "330";  */
"Database Names As List (Fuzzy Search)" = "Datenbanken als Liste (UBA-Suche)";

/*  Class = "NSMenuItem"; gToolTip = "¦$SP_ASLIST_ALL_TABLES¦ – such a snippet will be shown as completion list with all table names (incl. views) from the current selected database\n\n[only available inside of tab snippets]"; ObjectID = "332";  */
"¦$SP_ASLIST_ALL_TABLES¦ – such a snippet will be shown as completion list with all table names (incl. views) from the current selected database\n\n[only available inside of tab snippets]" = "¦$SP_ASLIST_ALL_TABLES¦ – Wird als Auswahlliste mit den Namen der Tabellen und Views der ausgewählten Datenbank angezeigt.\nKann nur innerhalb von Tab-Snippets benutzt werden!";

/*  Class = "NSMenuItem"; title = "Table Names As List"; ObjectID = "332";  */
"Table Names As List" = "Tabellen als Liste";

/*  Class = "NSMenuItem"; gToolTip = "$1 – mirrored tab snippet which is a placeholder for the content of tab snippet “1”\n\n[“1” can be a number from 0 to 18 and defines the order of tab key down events]\n\n[may not be used inside of a tab snippet] "; ObjectID = "340";  */
"$1 – mirrored tab snippet which is a placeholder for the content of tab snippet “1”\n\n[“1” can be a number from 0 to 18 and defines the order of tab key down events]\n\n[may not be used inside of a tab snippet] " = "$1 – Wird mit dem Inhalt des Tab-Snippets mit der entsprechenden Nummer ersetzt. \"1\" kann eine Zahl zwischen 0 und 18 sein, die in einem Tab-Snippet verwendet wird.\n Darf nicht innerhalb von Tab-Snippets benutzt werden!";

/*  Class = "NSMenuItem"; title = "Table Names As List (Fuzzy Search)"; ObjectID = "333";  */
"Table Names As List (Fuzzy Search)" = "Tabellen als Liste (UBA-Suche)";

/*  Class = "NSMenuItem"; gToolTip = "¦$SP_ASLIST_ALL_FIELDS¦ – such a snippet will be shown as completion list with all field names from the current selected table\n\n[only available inside of tab snippets]"; ObjectID = "334";  */
"¦$SP_ASLIST_ALL_FIELDS¦ – such a snippet will be shown as completion list with all field names from the current selected table\n\n[only available inside of tab snippets]" = "¦$SP_ASLIST_ALL_FIELDS¦ – Wird als Auswahlliste mit den Namen der Spalten in der ausgewählten Tabelle angezeigt.\nKann nur innerhalb von Tab-Snippets benutzt werden!";

/*  Class = "NSMenuItem"; title = "Field Names As List of Current Table"; ObjectID = "334";  */
"Field Names As List of Current Table" = "Spalten in Tabelle als Liste";

/*  Class = "NSMenuItem"; gToolTip = "¦¦$SP_ASLIST_ALL_FIELDS¦¦ – such a snippet will be shown as completion list with all field names from the current selected table\n\n[only available inside of tab snippets]"; ObjectID = "335";  */
"¦¦$SP_ASLIST_ALL_FIELDS¦¦ – such a snippet will be shown as completion list with all field names from the current selected table\n\n[only available inside of tab snippets]" = "¦¦$SP_ASLIST_ALL_FIELDS¦¦ – Wird als Auswahlliste mit den Namen aller Spalten in der ausgewählten Tabelle angezeigt. Bei der Auswahl ist die UBA-Suche möglich.\nKann nur innerhalb von Tab-Snippets benutzt werden!";

/*  Class = "NSMenuItem"; title = "Field Names As List of Current Table (Fuzzy Search)"; ObjectID = "335";  */
"Field Names As List of Current Table (Fuzzy Search)" = "Spalten in Tabelle als Liste (UBA-Suche)";

/*  Class = "NSMenuItem"; title = "Completion Lists:"; ObjectID = "336";  */
"Completion Lists:" = "Auswahllisten:";

/*  Class = "NSMenuItem"; title = "⇥ Snippet:"; ObjectID = "337";  */
"⇥ Snippet:" = "⇥-Snippets:";

/*  Class = "NSMenuItem"; title = "Completion List:"; ObjectID = "338";  */
"Completion List:" = "Eigene Auswahllisten:";

/*  Class = "NSMenuItem"; title = "Selection:"; ObjectID = "339";  */
"Selection:" = "Auswahl:";

/*  Class = "NSMenuItem"; gToolTip = "¦¦$SP_ASLIST_ALL_TABLES¦¦ – such a snippet will be shown as completion list with all table names (incl. views) from the current selected database in fuzzy search mode\n\n[only available inside of tab snippets]"; ObjectID = "333";  */
"¦¦$SP_ASLIST_ALL_TABLES¦¦ – such a snippet will be shown as completion list with all table names (incl. views) from the current selected database in fuzzy search mode\n\n[only available inside of tab snippets]" = "¦¦$SP_ASLIST_ALL_TABLES¦¦ – Wird als Auswahlliste mit den Namen aller Tabellen und Views in der ausgewählten Datenbank angezeigt. Bei der Auswahl ist die UBA-Suche möglich.\nKann nur innerhalb von Tab-Snippets benutzt werden!";

/*  Class = "NSMenuItem"; title = "Mirrored Tab Snippet"; ObjectID = "340";  */
"Mirrored Tab Snippet" = "Gespiegeltes Tab-Snippet";

/*  Class = "NSMenuItem"; title = "Placeholder"; ObjectID = "341";  */
"Placeholder" = "Platzhalter";

/*  Class = "NSTextField"; gToolTip = "Alphanumeric character string which inserts the favorite query string after expansion by pressing the ⇥ key."; ObjectID = "306";  */
"Alphanumeric character string which inserts the favorite query string after expansion by pressing the ⇥ key." = "Geben Sie im Abfrage-Editor diese Zeichenkette gefolgt von ⇥ (Tab-Taste) ein, um den ausgewerteten Abfrage-Favoriten einzufügen.";

